ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV160/ESP32_WordClockV160.ino
    case 'S':                                                                                 // Slope factor for brightness
      validLength = (len > 1 && len < 5);
      if(validLength) 
       {
        Mem.LightReducer = (byte)SConstrainInt(InputString, 1, 1, 255);
        snprintf(sptext, sizeof(sptext), "Slope brightness changed to: %d%%", Mem.LightReducer);
       } 
      else snprintf(sptext, sizeof(sptext), "**** Input fault. \nEnter Snnn where n between 1 and 255");
      break;
      
    case 'T':                                                                                 // Time setting
      if(len == 7) 
       {
        timeinfo.tm_hour = (int)SConstrainInt(InputString, 1, 3, 0, 23);
        timeinfo.tm_min  = (int)SConstrainInt(InputString, 3, 5, 0, 59);
        timeinfo.tm_sec  = (int)SConstrainInt(InputString, 5, 7, 0, 59);
        if(DS3231Installed)   SetDS3231Time();
        else snprintf(sptext, sizeof(sptext), "No external RTC module detected");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter Thhmmss ****");
      break;
      
    case 'U':                                                                                 // Demo mode
      if(len == 1) 
      { 
        if(Demo)  {   lastminute = 99;  Demo = false; }                                       // Force a minute update and turn off demo mode
        else { MilliSecondValue = 200;  Demo = true;  }                                       // If Demomode was off turn it on with 200 msec delay 
        snprintf(sptext, sizeof(sptext), "Demo mode: %s, %d msec/min", Demo ? "ON" : "OFF", MilliSecondValue);    
       } 
      else if(len > 1 && len < 6) 
       {
        MilliSecondValue = InputString.substring(1, 5).toInt();
        Demo = true;
        snprintf(sptext, sizeof(sptext), "Demo mode: %s, %d msec/min", Demo ? "ON" : "OFF", MilliSecondValue);
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault U. Demo mode (Unnn or U) ****");
      break;
      
    case 'W':                                                                                 // WIFI toggle
      if(len == 1) 
       {
        Mem.WIFIOn = 1 - Mem.WIFIOn;
        Mem.NTPOn = Mem.WIFIOn;                                                               // If WIFI is off turn NTP also off
        snprintf(sptext, sizeof(sptext), "WIFI is %s after restart", Mem.WIFIOn ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter W ****");
      break;
      
    case 'X':                                                                                 // NTP toggle
      if(len == 1) 
       {
        Mem.NTPOn = 1 - Mem.NTPOn;
        snprintf(sptext, sizeof(sptext), "NTP is %s after restart", Mem.NTPOn ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter X ****");
      break;
      
    case 'Y':                                                                                 // Play lights
      Play_Lights();
      lastminute = 99;                                                                        // Force a minute update
      snprintf(sptext, sizeof(sptext), "**** Play Lights");
      break;
      
    case 'Z':                                                                                 // Start WPS
      snprintf(sptext, sizeof(sptext), "**** Start WPS on your router");
      WiFi.onEvent(WiFiEvent);
      WiFi.mode(WIFI_STA);
      Tekstprintln("Starting WPS");
      wpsInitConfig();
      wpsStart();
      break;
      
    case '!':                                                                                 // Print times
      if(len == 1) PrintAllClockTimes();
      sprintf(sptext,"\n");
      break;
      
    case '@':                                                                                 // Reset ESP
      if(len == 1) 
       {
        Tekstprintln("\n*********\n ESP restarting\n*********\n");
        ESP.restart();
       } 
      else sprintf(sptext, "**** Length fault. Enter @ ****");
      break;
      
    case '#':                                                                                 // Self test
      if(len == 1) 
       {
        Zelftest = 1 - Zelftest;
        snprintf(sptext, sizeof(sptext), "Zelftest: %s", Zelftest ? "ON" : "OFF");
        Selftest();
        Displaytime(); Tekstprintln("");
       } 
      else if(len > 1 && len < 6) 
       {
        MilliSecondValue = InputString.substring(1, 5).toInt();
        Zelftest = 1 - Zelftest;
        snprintf(sptext, sizeof(sptext), "Zelftest: %s", Zelftest ? "ON" : "OFF");
        Selftest(MilliSecondValue);
        Displaytime(); Tekstprintln("");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault #. Demo mode (#nnnn or #) ****");
      break;
      
    case '$':                                                                                 // Fire display
      FireDisplay = 1 - FireDisplay;
      snprintf(sptext, sizeof(sptext), "FireDisplay: %s", FireDisplay ? "On" : "Off");
      ClearScreen();
      Displaytime(); Tekstprintln("");
      break;
      
    case '%':                                                                                 // LED strip type
      if(len == 1) 
       {
        Mem.LEDstrip = 1 - Mem.LEDstrip;
        snprintf(sptext, sizeof(sptext), "LED strip is %s after restart", Mem.LEDstrip ? "WS2812" : "SK6812");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault . ****");
      break;

     case '^':                                                                                 // *** Empty ***
      if(len == 1) 
       {
       snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault . ****");
      break;

    case '&':                                                                                 // Force NTP update
      if(len == 1) 
       {
        if(GetNTPtime(false))  SetDS3231Time();                                               // Only set time in DS3231 if time is valid
        SetRTCTime();
        PrintAllClockTimes();
        sptext[0] =0 ;
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault &. ****");
      break;
      
    case '(':  
      Mem.EdSoftLEDSOn = !Mem.EdSoftLEDSOn;
      snprintf(sptext, sizeof(sptext), "EDSOFT is %s", Mem.EdSoftLEDSOn ? "ON" : "OFF");
      lastminute = 99;                                                                        // Force a minute update
      break;

    case ')':
      Mem.HetIsWasOff = !Mem.HetIsWasOff;
      snprintf(sptext, sizeof(sptext), "HET IS WAS is %s", Mem.HetIsWasOff ? "OFF" : "ON");
      lastminute = 99;                                                                        // Force a minute update
      break;

